app/views/group_emails/index.html.erb

        <td><%= group_email.sender_id %></td>
        <td><%= @group_emails_recipients.to_group_email(group_email.id).each do |r| %>
---
SELECT "group_emails".* FROM "group_emails"