app/controllers/emails_controller.rb

  def index
    @emails_Received = Email.received_messages(current_user.id).all
---
SELECT "emails".* FROM "emails"  WHERE (recipient_id LIKE 2) AND (sender_id LIKE 2)

  def create
    #TODO DA SE PREPRAVI DA I ZA SINGLE I GRUPNE I SVE BUDE NA JEDNOJ STRANICI!!!!!!
    #TODO TO OSTAJE ZA SUTRA SAD SAM PRSO VISE OD OVU GLUPOST!!!
    @email = Email.new(email_params)
    @email.sender_id = current_user.id
    respond_to do |format|
      if @email.save
        if current_user.has_role? :admin
        @last = Email.last
        user_in_last_post = @last.recipient_id
        user = User.user(user_in_last_post).last
---
INSERT INTO "emails" ("created_at", "message_body", "message_subject", "recipient_id", "sender_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-11-06 08:12:54.911977"], ["message_body", "123"], ["message_subject", "123"], ["recipient_id", 1], ["sender_id", 2], ["updated_at", "2014-11-06 08:12:54.911977"]]
SELECT  "emails".* FROM "emails"   ORDER BY "emails"."id" DESC LIMIT 1
SELECT  "users".* FROM "users"  WHERE (recipient_id LIKE 'recipient_id')  ORDER BY "users"."id" DESC LIMIT 1

    def set_email
      @email = Email.find(params[:id])
---
SELECT  "emails".* FROM "emails"  WHERE "emails"."id" = $1 LIMIT 1  [["id", 46]]