app/controllers/group_emails_controller.rb

  def index

    if current_user.has_role? :admin
      @group_emails = GroupEmail.all
---
SELECT "group_emails".* FROM "group_emails"

  def create
    @group_email = GroupEmail.new(group_email_params)
    @group_email.sender_id = current_user.id
    respond_to do |format|
      if @group_email.save
---
INSERT INTO "group_emails" ("created_at", "message_body", "message_subject", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-07 07:37:56.489138"], ["message_body", ""], ["message_subject", ""], ["updated_at", "2014-11-07 07:37:56.489138"]]

  def set_group_email
    @group_email = GroupEmail.find(params[:id])
---
SELECT  "group_emails".* FROM "group_emails"  WHERE "group_emails"."id" = $1 LIMIT 1  [["id", 1]]