app/views/emails/_form.html.erb

    <div class="controls">
      <%= f.select :recipient_id, User.all.map { |v| [ v.email, v.id ] } ,:class => 'form-control' %>
---
SELECT  "emails".* FROM "emails"  WHERE "emails"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users"